SELECT заказы1.*, Дата_поставки AS Expr1
FROM     заказы1
WHERE  (Дата_поставки > CONVERT(DATETIME, '2026-01-01 00:00:00', 102))

SELECT ТОВАРЫ.*, Цена AS Expr1
FROM     ТОВАРЫ
WHERE  (Цена BETWEEN 50 AND 200)

SELECT ЗАКАЗЧИКИ.Наименование_фирмы
FROM     ЗАКАЗЧИКИ INNER JOIN
                  заказы1 ON ЗАКАЗЧИКИ.Наименование_фирмы = заказы1.Заказчик
WHERE  (заказы1.Наименование_товара = N'Стол')

SELECT заказы1.Дата_поставки AS Expr1, заказы1.*
FROM     заказы1 INNER JOIN
                  ЗАКАЗЧИКИ ON заказы1.Заказчик = ЗАКАЗЧИКИ.Наименование_фирмы
WHERE  (заказы1.Заказчик = N'ООО Ромашка')
ORDER BY заказы1.Дата_поставки