use ПРОДАЖИ
SELECT ТОВАРЫ.Наименование, ТОВАРЫ.ЦЕНА, Заказы.Цена_продажи
	FROM Заказы inner join ТОВАРЫ
	on Заказы.Наименование_товара = ТОВАРЫ.Наименование

select Заказы.Наименование_товара, ТОВАРЫ.ЦЕНА, Заказы.Цена_продажи
	from Заказы inner join ТОВАРЫ
	on Заказы.Цена_продажи = ТОВАРЫ.ЦЕНА and
		Заказы.Наименование_товара like '%ст%'

select Заказы.Наименование_товара, ТОВАРЫ.ЦЕНА, Заказы.Цена_продажи
	from Заказы, ТОВАРЫ
	Where Заказы.Цена_продажи = ТОВАРЫ.ЦЕНА


select ТОВАРЫ.Наименование, Заказы.Дата_поставки,
	Case
	when(Заказы.Цена_продажи between 1 and 50) then 'цена<50'
	when(Заказы.Цена_продажи between 50 and 100) then '50<цена<100'
	else 'цена>100'
	end [Пределы цен]
from ТОВАРЫ inner join Заказы
on ТОВАРЫ.Наименование = Заказы.Наименование_товара
order by Заказы.Наименование_товара

select isnull (Заказы.Наименование_товара, '**') [Товар], ТОВАРЫ.Количество
from ТОВАРЫ left outer join Заказы
on ТОВАРЫ.Наименование = Заказы.Наименование_товара

select * from ТОВАРЫ at full outer join Заказы aa
	on aa.Наименование_товара = at.Наименование
	order by aa.Наименование_товара, at.Наименование

select count(*) from ТОВАРЫ at full outer join Заказы aa
	on aa.Наименование_товара = at.Наименование
	Where Номер_заказа is null

select ТОВАРЫ.Наименование, ТОВАРЫ.ЦЕНА, Заказы.Цена_продажи
	from заказы cross join ТОВАРЫ
	where Заказы.Наименование_товара = ТОВАРЫ.Наименование
